# ğŸ“š Sistema de RecomendaÃ§Ã£o de Livros em Prolog
Este projeto implementa um sistema de recomendaÃ§Ã£o de livros utilizando a linguagem lÃ³gica Prolog. O sistema permite consultar livros por gÃªnero, autor, ano de publicaÃ§Ã£o e combinaÃ§Ãµes desses critÃ©rios.

# ğŸ”§ PrÃ©-requisitos
Antes de executar o cÃ³digo, Ã© necessÃ¡rio instalar o SWI-Prolog em sua mÃ¡quina.

Linux: Execute sudo apt install swi-prolog

macOS: Use o Homebrew: brew install swi-prolog

Windows: Baixe o instalador em swi-prolog.orgâ€‹

# ğŸš€ Como executar
Clone este repositÃ³rio:â€‹

bash
Copiar
git clone https://github.com/seuusuario/sistema-livros-prolog.git
cd sistema-livros-prolog
Abra o terminal do SWI-Prolog:â€‹
GitHub
+1
GitHub
+1

bash
Copiar
swipl
Carregue o arquivo Prolog:â€‹

## prolog
Copiar
?- consult('nomedoarquivo.pl').
Execute as consultas desejadas:â€‹

prolog
Copiar
?- recomendar(ficcao_cientifica).
?- recomendar_autor('asimov').
?- recomendar(ficcao_cientifica, 'asimov').
?- recomendar(ficcao_cientifica, 'asimov', 1951).
ğŸ“„ Estrutura do cÃ³digo
Base de Conhecimento: ContÃ©m fatos sobre livros, incluindo tÃ­tulo, gÃªnero, autor e ano de publicaÃ§Ã£o.

## Regras de RecomendaÃ§Ã£o:

recomendar(Genero): Recomenda livros de um gÃªnero especÃ­fico.

recomendar_autor(Autor): Recomenda livros de um autor especÃ­fico.

recomendar(Genero, Autor): Recomenda livros de um gÃªnero e autor especÃ­ficos.

recomendar(Genero, Autor, Ano): Recomenda livros de um gÃªnero, autor e ano especÃ­ficos.â€‹

## ğŸ§ª Exemplos de uso
prolog
Copiar
?- recomendar(fantasia).
?- recomendar_autor('asimov').
?- recomendar(fantasia, 'tolkien').
?- recomendar(fantasia, 'tolkien', 1937).
## ğŸ“Œ ObservaÃ§Ãµes
As consultas retornam os livros que atendem aos critÃ©rios especificados.

O sistema utiliza o predicado write/1 para exibir os resultados no terminal.

Para evitar o retorno de true ou false apÃ³s a execuÃ§Ã£o das consultas, o cÃ³digo foi estruturado para finalizar a execuÃ§Ã£o sem retornar valores adicionais.
